app/views/restaurants/_form.html.erb

    <%= f.label :neighborhood %>
    <%= collection_select(:restaurant, :neighborhood_id, Neighborhood.all, :id, :name, prompt: true) %>
---
SELECT "neighborhoods".* FROM "neighborhoods"

    <%= f.label :categories %>
    <%= collection_check_boxes(:restaurant, :category_ids, Category.all, :id, :name) %>
---
SELECT "categories".* FROM "categories"