app/views/restaurants/show.html.erb

<p>
  <% @restaurant.categories.each do |c| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "restaurants_categories" ON "categories"."id" = "restaurants_categories"."category_id" WHERE "restaurants_categories"."restaurant_id" = ?  [["restaurant_id", 1]]