app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 8]]
---
  def edit
    @category = Category.find_by_id(params[:id])

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 6]]
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 6]]
---
  def destroy
    @category = Category.find_by_id(params[:id])

    @category.delete