app/controllers/neighborhoods_controller.rb

SELECT "neighborhoods".* FROM "neighborhoods"
---
  def index
    @neighborhoods = Neighborhood.all

SELECT  "neighborhoods".* FROM "neighborhoods" WHERE "neighborhoods"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @neighborhood = Neighborhood.find_by_id(params[:id])

SELECT  "neighborhoods".* FROM "neighborhoods" WHERE "neighborhoods"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @neighborhood = Neighborhood.find_by_id(params[:id])

SELECT  "neighborhoods".* FROM "neighborhoods" WHERE "neighborhoods"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "neighborhoods" SET "name" = ?, "updated_at" = ? WHERE "neighborhoods"."id" = ?  [["name", "Midtown East"], ["updated_at", "2016-05-19 20:28:46.540529"], ["id", 1]]
---
  def update
    @neighborhood = Neighborhood.find_by_id(params[:id])

    if @neighborhood.update(neighborhood_params)

INSERT INTO "neighborhoods" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Midtown"], ["created_at", "2016-05-19 20:48:22.227018"], ["updated_at", "2016-05-19 20:48:22.227018"]]
---
  def create
    @neighborhood = Neighborhood.new(neighborhood_params)

    if @neighborhood.save

SELECT  "neighborhoods".* FROM "neighborhoods" WHERE "neighborhoods"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "neighborhoods" WHERE "neighborhoods"."id" = ?  [["id", 4]]
---
  def destroy
    @neighborhood = Neighborhood.find_by_id(params[:id])

    @neighborhood.delete